/* */
s = '3 1 2 0 0 2 2 2 3 0 2 0 3 3 1 2 0 2 3 0 0 3 0 1 3 1 3 2 0 2 2 2'
s = s '2 0 1 2 2 3 2 3 2 0 2 2 0 2 3 0 3 1 2 0 3 1 0 1 0 2 2 3 3 2 3 2'
s = s '0 2 0 1 3 0 1 2 1 0 1 0 3 2 0 3 0 0 1 0 1 3 0 2 2 1 3 2 1 0 3 0'
s = s '2 2 3 0 2 2 2 2 3 2 0 3 0 0 3 3 1 2 1 1 2 2 1 1 0 3 0 0 2 3 1 3'
s = s '2 2 0 0 0 1 2 1 2 0 1 1 0 2 2 0 0 2 2 1 3 2 1 2 1 3 0 0 2 3 3 0'
s = s '0 0'

/* kd5tfd em10dm 18 */
s = '3 1 2 0 0 0 2 0 3 0 2 0 3 1 1 0 0 2 3 2 0 1 0 3 3 3 3 0 0 0 2 2'
s = s '2 0 1 0 2 3 2 3 2 2 2 2 0 0 3 2 3 1 2 0 3 1 0 3 0 2 2 1 3 2 3 0'
s = s '0 2 0 1 3 0 1 2 1 2 1 2 3 0 0 3 0 0 1 0 1 3 0 2 2 1 3 0 1 0 3 2'
s = s '2 2 3 2 2 2 2 2 3 2 0 3 0 2 3 3 1 2 1 3 2 0 1 3 0 1 0 2 2 3 1 1'
s = s '2 2 0 2 0 3 2 3 2 0 1 1 0 2 2 2 0 2 2 1 3 2 1 0 1 1 0 0 2 1 3 2'
s = s '0 0'

/* kd5tfd em10 20 */
s = '3 1 2 2 0 2 2 2 3 0 2 0 3 1 1 0 0 2 3 0 0 3 0 1 3 3 3 2 0 0 2 2'
s = s '2 0 1 0 2 3 2 3 2 0 2 2 0 2 3 2 3 1 2 0 3 3 0 1 0 2 2 1 3 0 3 0'
s = s '0 2 0 3 3 2 1 0 1 0 1 0 3 2 0 3 0 0 1 2 1 1 0 0 2 1 3 0 1 0 3 0'
s = s '2 2 3 2 2 0 2 0 3 0 0 1 0 2 3 3 1 2 1 3 2 0 1 3 0 3 0 0 2 3 1 1'
s = s '2 2 0 0 0 3 2 3 2 0 1 1 0 2 2 0 0 2 2 1 3 0 1 0 1 1 0 2 2 3 3 0'
s = s '0 0'


/* kd5tfd em10 23 - 200 mW */
s = '3 1 2 0 0 2 2 2 3 0 2 0 3 3 1 2 0 2 3 0 0 3 0 1 3 1 3 2 0 2 2 2'
s = s '2 0 1 2 2 3 2 3 2 0 2 2 0 2 3 0 3 1 2 0 3 1 0 1 0 2 2 3 3 2 3 2'
s = s '0 2 0 1 3 0 1 2 1 0 1 0 3 2 0 3 0 0 1 0 1 3 0 2 2 1 3 2 1 0 3 0'
s = s '2 2 3 0 2 2 2 2 3 2 0 3 0 0 3 3 1 2 1 1 2 2 1 1 0 3 0 0 2 3 1 3'
s = s '2 2 0 0 0 1 2 1 2 0 1 1 0 2 2 0 0 2 2 1 3 2 1 2 1 3 0 0 2 3 3 0'
s = s '0 0'

/* pe0nny aa00 23 */
s = '3 1 0 0 2 0 2 0 3 0 0 0 1 1 3 2 0 0 3 2 0 3 2 1 1 3 1 2 0 2 2 2'
s = s '2 2 1 2 0 1 0 3 2 2 2 2 2 0 1 0 1 3 2 0 1 3 0 1 0 2 0 3 1 0 1 2'
s = s '0 0 2 1 1 2 1 2 3 0 1 2 1 2 0 3 0 0 1 2 3 3 2 2 2 3 1 0 1 0 1 0'
s = s '0 0 1 2 0 2 0 2 1 0 0 1 2 2 1 3 1 2 1 1 0 2 1 1 2 1 0 0 0 3 1 3'
s = s '2 2 2 2 2 1 2 3 2 0 3 1 2 0 2 0 2 2 2 1 1 2 1 2 1 3 0 2 2 3 1 0'
s = s '2 0'

i = 0
do forever
  parse var s this s
  s = strip(s)
  this = strip(this)
  if this = '' then leave
  say i ':' this || ';'
  i = i + 1
end
