###########################################################################
#
# Generated by : Version 8.0 Build 215 05/29/2008 SJ Full Version
#
# Project      : Ozy_Janus
# Revision     : Ozy_Janus
#
# Date         : Sun Nov 23 12:04:58 AM Pacific Standard Time 2008
#
###########################################################################
 
 
# WARNING: Expected ENABLE_CLOCK_LATENCY to be set to 'ON', but it is set to 'OFF'
#          In SDC, create_generated_clock auto-generates clock latency
#
# ------------------------------------------
#
# Create generated clocks based on PLLs
derive_pll_clocks -use_tan_name
#
# ------------------------------------------
# WARNING: Global Fmax translated to derive_clocks. Behavior is not identical
if {![info exist ::qsta_message_posted]} {
    post_message -type warning "Original Global Fmax translated from QSF using derive_clocks"
    set ::qsta_message_posted 1
}
derive_clocks -period "48 MHz"
#


# Original Clock Setting Name: 48MHz clock
create_clock -period "20.833 ns" \
             -name {IFCLK} {IFCLK}
# ---------------------------------------------


# Original Clock Setting Name: CLK_12MHZ
create_clock -period "81.380 ns" \
             -name {CLK_12MHZ} {CLK_12MHZ}
# ---------------------------------------------


# Original Clock Setting Name: PCLK_12MHZ
create_clock -period "80.000 ns" \
             -name {PCLK_12MHZ} {PCLK_12MHZ}
# ---------------------------------------------


# Original Clock Setting Name: MCLK_12MHZ
create_clock -period "20.833 ns" \
             -name {MCLK_12MHZ} {MCLK_12MHZ}
# ---------------------------------------------


# Original Clock Setting Name: SPI_SCK
create_clock -period "20.833 ns" \
             -name {SPI_SCK} {SPI_SCK}
# ---------------------------------------------


# Original Clock Setting Name: FX2_CLK
create_clock -period "20.833 ns" \
             -name {FX2_CLK} {FX2_CLK}
# ---------------------------------------------


# Original Clock Setting Name: BCLK to AK5394A
# WARNING: Ignoring OFFSET_FROM_BASE_CLOCK assignment for clock 'BCLK to AK5394A'
create_generated_clock -multiply_by 1  \
                       -source CLK_12MHZ \
                       -name {BCLK} \
                       {BCLK}
# ---------------------------------------------


# Original Clock Setting Name: LRCLK to AD5394A
# WARNING: Ignoring OFFSET_FROM_BASE_CLOCK assignment for clock 'LRCLK to AD5394A'
create_generated_clock -divide_by 64 -multiply_by 1  \
                       -source CLK_12MHZ \
                       -name {LRCLK} \
                       {LRCLK}
# ---------------------------------------------


# Original Clock Setting Name: CBCLK to TLV320
# WARNING: Ignoring OFFSET_FROM_BASE_CLOCK assignment for clock 'CBCLK to TLV320'
create_generated_clock -divide_by 4 -multiply_by 1  \
                       -source CLK_12MHZ \
                       -name {CBCLK} \
                       {CBCLK}
# ---------------------------------------------


# Original Clock Setting Name: CLRCLK to TLV320
# WARNING: Ignoring OFFSET_FROM_BASE_CLOCK assignment for clock 'CLRCLK to TLV320'
create_generated_clock -divide_by 256 -multiply_by 1  \
                       -source CLK_12MHZ \
                       -name {CLRCLK} \
                       {CLRCLK}
# ---------------------------------------------

# ** Clock Latency
#    -------------

# ** Clock Uncertainty
#    -----------------

# ** Multicycles
#    -----------
# ** Cuts
#    ----

# ** Input/Output Delays
#    -------------------




# ** Tpd requirements
#    ----------------

# ** Setup/Hold Relationships
#    ------------------------

# ** Tsu/Th requirements
#    -------------------


# ** Tco/MinTco requirements
#    -----------------------

#
# Entity Specific Timing Assignments found in
# the Timing Analyzer Settings report panel
#
set_false_path -from [get_keepers {*dcfifo_01j1*|delayed_wrptr_g[*]}] -to [get_keepers {*dcfifo_01j1*|*rs_dgwp|*dffpipe5|dffe6a[*]}]
set_false_path -from [get_keepers {*dcfifo_01j1*|rdptr_g[*]}] -to [get_keepers {*dcfifo_01j1*|*ws_dgrp|*dffpipe7|dffe8a[*]}]
set_false_path -from [get_keepers {*dcfifo_oqj1*|delayed_wrptr_g[*]}] -to [get_keepers {*dcfifo_oqj1*|*rs_dgwp|*dffpipe5|dffe6a[*]}]
set_false_path -from [get_keepers {*dcfifo_oqj1*|rdptr_g[*]}] -to [get_keepers {*dcfifo_oqj1*|*ws_dgrp|*dffpipe7|dffe8a[*]}]


# ---------------------------------------------
# The following clock group is added to try to 
# match the behavior of:
#   CUT_OFF_PATHS_BETWEEN_CLOCK_DOMAINS = ON
# ---------------------------------------------

set_clock_groups -asynchronous \
                 -group { \
                       SPI_SCK \
                        } \
                 -group { \
                       MCLK_12MHZ \
                        } \
                 -group { \
                       FX2_CLK \
                        } \
                 -group { \
                       PCLK_12MHZ \
                        } \
                 -group { \
                       CLK_12MHZ \
                       BCLK \
                       LRCLK \
                       CBCLK \
                       CLRCLK \
                        } \
                 -group { \
                       IFCLK \
                        } \

# ---------------------------------------------

